<a href="https://colab.research.google.com/github/y001003/yeardream/blob/main/sql/SQL_%EC%8B%A4%EA%B0%95.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# DDA

## Domain Type

- CHAR(n) : String 고정길이(n)로 내용을 넣고 싶을때
- VARCHAR(n) : 일반길이 String 넣고 싶을 때 n = maximum length
- INT : Integer 정수보통 32바이트, 시스템이 사용하는 체제에 따라 바이트 크기가 달라질 수 있다.
- SMALLINT 
- NUMERIC(p,d) : 실수, 점찍는 위치를 정해 놓는 방법, 소수를 표현하는 방법, 출력하는 방법을 고정시킨다. (p= 전체 자릿수, d = 소수 자릿수)
- FLOAT(n)

## CREATE

Schema에서 entitiy를 보고 테이블을 생성하는 커맨드

In [ ]:
CREATE TABLE t_name(
#attribute DOMAIN TYPE
    id CHAR(5),
    name VARCHAR(20),
    dept_name VARCHAR(20),
    salary NUMERIC(8,2)
);

Constraint
- PRIMARY KEY (A1,...,An)
- FOREIGN KEY (A1,...,An) REFERENCES table
- NOT NULL

In [ ]:
CREATE TABLE instructor(
#attribute DOMAIN TYPE
    id CHAR(5),
    name VARCHAR(20) NOT NULL,
    dept_name VARCHAR(20),
    salary NUMERIC(8,2)
    # attribute 정의 이후에 Constraint 정의
    PRIMARY KEY (id),
    FOREIGN KEY (dept_name) REFERENCES department
);

In [ ]:
CREATE TABLE takes(
#attribute DOMAIN TYPE
    id VARCHAR(5),
    course_id VARCHAR(8) NOT NULL,
    sec_id VARCHAR(8),
    semester VARCHAR(8),
    year NUMERIC(4,0),
    grade VARCHAR(2),
    # attribute 정의 이후에 Constraint 정의
    PRIMARY KEY (id, course_id, sec_id),
    FOREIGN KEY (id) REFERENCES student
);

- INSERT (row 삽입)
    - 추가할 데이터는 tuple 이기에 column 순서가 맞아야 한다.
    - String을 넣을 때는 '   ' 를 사용한다.
    - INSERT INTO instructor VALUES ('102110','Smith','Biology',66000);
- DELETE
- DROP TABLE (table 삭제)
- ALTER
    - ALTER TABLE r ADD a, d
    - ALTER TABLE r DROP a

## SELECT 쿼리

거의 대부분은 select 커맨드를 사용하게 된다. 쿼리문은 대소문자를 구분하지 않는다.   
- SELECT name FROM instructor

용도 : find 검색하는 용도로 사용한다.
- keyowrd
    - DISTINCT : 가져온 column의 unique한 row만 불러온다.
        - SELECT DISTINCT name FROM instructor
    - ALL

asterisk(*) 는 모든 속성 컬럼을 가져온다.
- SELECT * FROM instructor

SELECT 문 안에 연산자 사용도 가능하다.
- SELECT salary/12 FROM instructor

## FROM 쿼리

SELECT * FROM instructor, teaches 와 같은 형태로 두개 이상의 테이블을 FROM 뒤에 붙여서 가져올 수 있다.

그럴 경우 두 테이블로 생성 되는 모든 경우의 수의 row를 만들어서 가져온다.

## WHERE 쿼리

SELECT a1,a2 FROM r1,r2 WHERE P
- a1,a2 : 내가 출력하고 싶은 column들
- r1,r2 : 데이터가 들어있는 table들
- P : 찾을 데이터(row)의 조건

$ \rightarrow $ 결과가 table로 나온다.

조건은 연산자 사용이 다 가능하다. 그리고 로직은 and, or, not 을 사용한다.

In [ ]:
SELECT name
FROM instructor
WHERE dept_name = 'Comp. Sci' and salary > 8000

### 비교 연산자

=, !=, >, >=, < , <= 사용 가능하다

논리 연산자 and, or, not 가능

## String Operations

percent( % ) : 앞뒤에 '%.com%' .com 을 포함하는 문자를 가져와라
underscore ( __ ) : __ 정확히 두글자 문자인 열을 가져와라

Ordering

ORDER BY : 오름차순 (defalt)
ORDER BY r DESC : 내림차순

## Set Operation 집합연산

쿼리문과 쿼리문으로 뽑아낸 두개 테이블 사이를 연산이 가능하다.

- UNION : or
- INTERSECT : and
- EXCEPT : but not

## Null

null은 0 과 다르다.

아예 값 그 공간안에 존재 하지 않는 것

NULL 유무 확인은 =로 불가능하고

IS NULL 혹은 IS NOT NULL 이라고만 체크 가능하다.

### Aggregate Functions

avg, count, min, max, sum 함수 연산이 가능하다.

In [ ]:
# avg
SELECT avg(salary)
FROM instructor
WHERE dept_name = 'Comp. Sci';
# count
SELECT count(DISTINCT id)
FROM teaches
WHERE semester = 'Spring' and year = 2018;

Group By

In [ ]:
SELECT dept_name,avg(salary) as avg_salary
FROM instructor
GROUP BY dept_name;